In [1]:
import pandas as pd

In [2]:
urlfile_confirmed = "https://raw.githubusercontent.com/CSSEGISandData/COVID-19/master/csse_covid_19_data/csse_covid_19_time_series/time_series_covid19_confirmed_global.csv"

urlfile_deaths = "https://raw.githubusercontent.com/CSSEGISandData/COVID-19/master/csse_covid_19_data/csse_covid_19_time_series/time_series_covid19_deaths_global.csv"

df_confirmed =  pd.read_csv(urlfile_confirmed)
df_deaths =  pd.read_csv(urlfile_deaths)

In [3]:
df_confirmed.head()

,Province/State,Country/Region,Lat,Long,1/22/20,1/23/20,1/24/20,1/25/20,1/26/20,1/27/20,...,4/14/22,4/15/22,4/16/22,4/17/22,4/18/22,4/19/22,4/20/22,4/21/22,4/22/22,4/23/22
0,NaN,Afghanistan,33.93911,67.709953,0,0,0,0,0,0,...,178352,178373,178387,178418,178457,178513,178574,178611,178638,178648
1,NaN,Albania,41.15330,20.168300,0,0,0,0,0,0,...,274376,274429,274462,274504,274520,274535,274606,274606,274737,274791
2,NaN,Algeria,28.03390,1.659600,0,0,0,0,0,0,...,265733,265738,265739,265739,265741,265746,265746,265754,265761,265761
3,NaN,Andorra,42.50630,1.521800,0,0,0,0,0,0,...,40709,40709,40709,40709,40709,40709,41013,41013,41013,41013
4,NaN,Angola,-11.20270,17.873900,0,0,0,0,0,0,...,99194,99194,99194,99194,99194,99287,99287,99287,99287,99287

In [4]:
df_deaths.head()

,Province/State,Country/Region,Lat,Long,1/22/20,1/23/20,1/24/20,1/25/20,1/26/20,1/27/20,...,4/14/22,4/15/22,4/16/22,4/17/22,4/18/22,4/19/22,4/20/22,4/21/22,4/22/22,4/23/22
0,NaN,Afghanistan,33.93911,67.709953,0,0,0,0,0,0,...,7676,7676,7676,7678,7679,7680,7680,7680,7680,7681
1,NaN,Albania,41.15330,20.168300,0,0,0,0,0,0,...,3495,3495,3496,3496,3496,3496,3496,3496,3496,3496
2,NaN,Algeria,28.03390,1.659600,0,0,0,0,0,0,...,6874,6874,6874,6874,6874,6874,6874,6874,6874,6874
3,NaN,Andorra,42.50630,1.521800,0,0,0,0,0,0,...,153,153,153,153,153,153,153,153,153,153
4,NaN,Angola,-11.20270,17.873900,0,0,0,0,0,0,...,1900,1900,1900,1900,1900,1900,1900,1900,1900,1900

In [5]:
print(df_confirmed.info())

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 284 entries, 0 to 283
Columns: 827 entries, Province/State to 4/23/22
dtypes: float64(2), int64(823), object(2)
memory usage: 1.8+ MB
None

### Finding aggregate sum of confirmed cases for all date columns and excluding Province, Country, Latitude, Longitude

#### Pandas Indexing

* Dataframe.[ ] ; This function also known as indexing operator
* Dataframe.loc[ ] : This function is used for labels.
* Dataframe.iloc[ ] : This function is used for positions or integer based
* Dataframe.ix[] : This function is used for both label and integer based

In [6]:
df_confirmed.iloc[1,9]

0

In [7]:
df_confirmed.iloc[1]

Province/State        NaN
Country/Region    Albania
Lat               41.1533
Long              20.1683
1/22/20                 0
                   ...
4/19/22            274535
4/20/22            274606
4/21/22            274606
4/22/22            274737
4/23/22            274791
Name: 1, Length: 827, dtype: object

In [8]:
df_confirmed.loc[1]

Province/State        NaN
Country/Region    Albania
Lat               41.1533
Long              20.1683
1/22/20                 0
                   ...
4/19/22            274535
4/20/22            274606
4/21/22            274606
4/22/22            274737
4/23/22            274791
Name: 1, Length: 827, dtype: object

In [9]:
#finding the aggregate sum of confirmed cases on a global level
df_confirmed.agg([sum])

,Country/Region,Lat,Long,1/22/20,1/23/20,1/24/20,1/25/20,1/26/20,1/27/20,1/28/20,...,4/14/22,4/15/22,4/16/22,4/17/22,4/18/22,4/19/22,4/20/22,4/21/22,4/22/22,4/23/22
sum,AfghanistanAlbaniaAlgeriaAndorraAngolaAntarcti...,5669.995846,6192.358524,557,657,944,1437,2120,2929,5580,...,502932802,503645731,504198041,504619899,505089291,506082451,507046645,507947338,508708884,509196481

In [10]:
# Select column 3 to 826 (index 4-827) and find sum
df_confirmed['Sum']=df_confirmed.iloc[:,4:827].sum(axis=1)
print(df_confirmed.head(10))

                 Province/State       Country/Region       Lat        Long  \
0                           NaN          Afghanistan  33.93911   67.709953
1                           NaN              Albania  41.15330   20.168300
2                           NaN              Algeria  28.03390    1.659600
3                           NaN              Andorra  42.50630    1.521800
4                           NaN               Angola -11.20270   17.873900
5                           NaN           Antarctica -71.94990   23.347000
6                           NaN  Antigua and Barbuda  17.06080  -61.796400
7                           NaN            Argentina -38.41610  -63.616700
8                           NaN              Armenia  40.06910   45.038200
9  Australian Capital Territory            Australia -35.47350  149.012400

   1/22/20  1/23/20  1/24/20  1/25/20  1/26/20  1/27/20  ...  4/15/22  \
0        0        0        0        0        0        0  ...   178373
1        0        0        0        0        0        0  ...   274429
2        0        0        0        0        0        0  ...   265738
3        0        0        0        0        0        0  ...    40709
4        0        0        0        0        0        0  ...    99194
5        0        0        0        0        0        0  ...       11
6        0        0        0        0        0        0  ...     7535
7        0        0        0        0        0        0  ...  9059944
8        0        0        0        0        0        0  ...   422729
9        0        0        0        0        0        0  ...    92330

   4/16/22  4/17/22  4/18/22  4/19/22  4/20/22  4/21/22  4/22/22  4/23/22  \
0   178387   178418   178457   178513   178574   178611   178638   178648
1   274462   274504   274520   274535   274606   274606   274737   274791
2   265739   265739   265741   265746   265746   265754   265761   265761
3    40709    40709    40709    40709    41013    41013    41013    41013
4    99194    99194    99194    99287    99287    99287    99287    99287
5       11       11       11       11       11       11       11       11
6     7535     7539     7539     7539     7567     7567     7571     7571
7  9060495  9060923  9060923  9060923  9060923  9060923  9060923  9060923
8   422747   422762   422770   422784   422799   422805   422814   422822
9    92330    93713    94486    95625    96854    97825    98760    99485

          Sum
0    67281564
1    84307439
2    96555320
3     9884665
4    27120419
5        1441
6     1487058
7  2539321647
8   145766775
9     6188750

[10 rows x 828 columns]

In [11]:
#Finding sum of all values in the sum column to get total confirmed cases globally
total_confirmed_cases = df_confirmed['Sum'].sum()
print("Total Confirmed Cases = ", total_confirmed_cases)

Total Confirmed Cases =  122488414675